#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>


//指针初阶与进阶
//指针:编程语言中的一个对象,利用地址,它的值指向存在电脑存储器中另一地方的值.地址指向所需的变量单元
//一个内存单元占一字节对应一个地址编号
//int* pa; 用来存放地址的变量叫指针变量,pa为int型的指针变量
//指针变量在32位平台占4字节(32bit),在64位平台占8字节(64bit)

int main()
{
	int a = 10;	//内存中占4字节
	int* pa = &a;	//取a的首地址存入pa指针,用来存放地址的变量叫指针变量
	*pa = 20;	//将指针pa指向的变量赋值为20

	//指针和指针类型
	char* pc;	//char类型的指针
	float* pf;	//float类型的指针
	printf("指针大小 %d\n", sizeof(pa));	//4
	printf("指针大小 %d\n", sizeof(pc));	//4
	printf("指针大小 %d\n", sizeof(pf));	//4

	//指针类型的意义
	a = 0x11223344;	//32位平台,16进制最大为0xffffffff,一个f为15占4bit(1111)
	pc = &a;	//char* pc;
	*pc = 0;	//char类型指针虽然占4字节,但是char类型原本为1字节的类型
	printf("char类型指针改int a=%x\n", a);	//11223300 ,char类型一字节,而int类型 44占一字节被char类型的指针改为00
	int arr[10] = { 0 };	//数组名为首元素地址
	int* p = arr;	//数组名就是首元素地址就是指针
	pc = arr;
	printf("p的地址为 %p\n", p);	//p和pc的地址一样
	printf("p+1的地址为 %p\n", p + 1);	//p+1的实际地址为p的地址+4(int类型的+1下一个地址要跳过一个int类型(4字节)即4个地址编号)
	printf("pc的地址为 %p\n", pc);
	printf("pc+1的地址为 %p\n", pc + 1);	//pc+1的地址为pc+1(char类型的+1下一个地址要跳过1个char类型(1字节)即1个地址编号)

	/*
		1.指针类型决定了:指针解引用时的权限有多大(简单理解:指针存放首元素地址,指针类型决定了从首地址开始一共可以访问几个地址,再结束)
		2.指针类型决定了:指针+1的步长(指针向前或向后走一步,能走多长字节),如int类型的指针+1一步就是4字节,char类型的指针一步为1字节,double类型的指针走一步就+8字节
	*/

	//指针的解引用: *pa ,表示pa指针对应的那个元素,解引用可以通过*pa来改变对应变量的值

	//野指针



	return 0;
}

