#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <string.h>
//字符串:用""括起来的一串字符
/*字符串的结束标准是\0的转义字符, 
在计算字符串长度时\0是结束标志,不算字符串的内容*/
int main() {
	//字符数组,数组:一组相同类型的元素
	char ac1[] = { "abc" };//数组元素实际有4个,最后为\0不显示
	char ac2[] = { 'a','b','c' };//没\0结束标志在c后面会有乱码,一般这样的数组自己在最后加上'\0'元素
	char ac3[] = {'a','b','c','\0'};//和1输出结果一样
	printf("ac1=%s\n", ac1);//输出abc字符串
	printf("ac2=%s\n", ac2);//输出abc字符加乱码的字符串(直到找到\0结束)
	printf("ac3=%s\n", ac3);//输出abc字符串
	int len = strlen("abc");//求字符串abc的长度
	printf("len=%d\n", len);//输出结果3,\0不算在字符串的内容不算在长度中
	printf("ac1size=%d\n", sizeof(ac1));//输出为4,sizeof求占用几个字节,一个英文字符占一个字节,中文占两个
	printf("ac1len=%d\n", strlen(ac1));//输出为3.只算字符串长度,不计算\0
	printf("ac2len=%d\n", strlen(ac2));//输出为随机数值


	//转义字符:转变其原来的意思, \ 为转义序列符
	printf("c:\text\text.txt\n");//\t变为tab键,制表跳格符,\n转义为换行符
	
	//	1.	\?	防止连续的问号?被解析成三字母词
	printf("(are you ok ??)\n");/*旧版本的编译器会将 ??) 解析为 ] ,变为 ok], 
								故想正确输出,需写为 \?\?) ,才能输出 ??) */

	/*	2.	\'	用于表示字符常量'	
			\"	用于表示字符串内部的双引号
			\\	用于表示一个反斜杠,防止被解析成一个转义序列符
	*/
	printf("\\\'输出\':%c\n", '\'');// \' 转义为一个' , \\ 转义为一个反斜杠\ .
	printf("测试\\\\和\\\":%s\n", "\"ab\\c\"");// \" 转义为一个"
	printf("测试无需转义的情况:%c\n", '"');// 当' " ' 或者" ' "的格式不会产生矛盾冲突时可用不用转义

	/*	3.	\a	警告字符,蜂鸣
	*		\b	退格符,按一次退格键
	*		\f	换页符,将当前位置移到下一页开头
	*		\n	换行符,换到下一行开头
	*		\r	回车符,回到当前行的行首，而不会换到下一行，如果接着输出的话，本行以前的内容会被逐一覆盖
	*		\t	tab水平制表符,按一下tab键,一般一个tab位为8个空格,
			\t	当它的前面有单词的时候，和单词长度加起来刚好能被 8 整除,
			\t	类似用空格来填充来凑满8个空格的长度
	*		\v	垂直制表符,类似连打回车
	*/
	printf("测试\\a和\\b:\a\a\a\nabc\babc\n");//蜂鸣,换行,输出ababc
	printf("测试\\f和\\t:\nabcd\fabcd\tabcefgh\tabc\n");//输出abcd abcd	abcdefgh abc
	printf("测试\\r和\\v:\nabc\refgh\vijk\n");//efgh ijk ,abc被覆盖

	/*	4.	\ddd	表示1-3个八进制的数字,如\130 ,d指0-9的数字
	*		\xdd	表示2个十六进制的数字,如\x30
	*/
	printf("Octal 130=%d\n",'\130');//输出88,八进制数130转十进制为88
	printf("ascii O(130)=%c\n",'\130');//输出为X,ascii码88为大写X
	printf("H(30)=%d\n", '\x30');//十六进制数30转十进制为48
	printf("asc H(30)=%c\n", '\x30');//asc码48为'0'(字符0)
	printf("stringlen=%d\n", strlen("c:\test\328\test.c我。"));//输出18
	//O(32)=26d,英文(英文标点)占一个字符,一个汉字(汉字标点)占两个字符,一整个转义字符算一个字符,\32,\t仅为一个字符

	/*	注释:用来解释复杂代码
	*	//int a = 1; c++的注释风格
	*/
	/*
	* int a = 1;	c语言的注释风格,不能嵌套注释,一次注释一块里面不能套注释
	*/
	return 0;
}