#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

/*
	数组:一组相同类型元素的集合
	type_t arr_name [const_n];
	type_t 指数组的元素类型  
	const_n 一个常量表达式,用来指定数组大小
*/


int main()
{

	int v[8];	//数组的定义;名叫v的数组,数组元素为int类型,数组大小为8个元素
	//int a[10] = { 0 };	//数组的初始化
	//int a[10] = { 1,2,3,4,5,6,7,8,9,10 };	//数组的初始化,完全初始化
	int a[10] = { 1,2,3,4,5,6,4 };	//数组的初始化,部分初始化
	//int a[] = { 1,2,3,4,5 };	//根据初始化内容确定数组大小与a[5]={1,2,3,4,5};等价

	//字符(串)数组	(tips:字符串数组最后有一位隐藏的结束字符'\0',除非每一个字符都自己初始化如ch2)
	char ch1[5] = {'b','i','t'};//字符串数组,大小为5,元素类型为字符型,部分初始化	{'b','i','t',0'\0',0'\0'}
	char ch2[] = {'b','i','t'};	//字符串数组,大小为3,元素类型为字符型	{'b','i','t'}
	char ch3[5] = "bit";	//和char ch3[5] = {"bit"};等价和ch1数组类似大小为5  {'b','i','t',0'\0',0'\0'}
	char ch4[] = "bit";		//和ch4[]={'b','i','t','\0'}等价,大小为4 	{'b','i','t','\0'}



	return 0;
}